import {Astronaut} from "./types";

export const requestTime = 1000


export const iAstronautsMock:Astronaut[] = [
    {
        id: 1,
        name: "Джон Доу",
        experience: "Опытный астронавт с множеством космических полетов. Специализируется на выходах в открытый космос и работе с робототехникой.",
        age: 45,
        country: "Соединенные Штаты",
        sex: "Мужской",
        status: 1,
        image: "",
    },
    {
        id: 2,
        name: "Джейн Смит",
        experience: "Бывший инженер со специализацией в системах космических аппаратов. Выбрана за свои технические навыки и умения решать проблемы.",
        age: 38,
        country: "Канада",
        sex: "Женский",
        status: 1,
        image: "",
    },
    {
        id: 3,
        name: "Михаил Иванов",
        experience: "Космонавт с обширным опытом в долгосрочных космических полетах. Обучен различным научным экспериментам на борту космических аппаратов.",
        age: 50,
        country: "Россия",
        sex: "Мужской",
        status: 1,
        image: "",
    },
]